import os

class script(object):

    START_TXT = """<b>Hᴇʟʟᴏ {}\n\n
ɪ ᴀᴍ ᴛʜᴇ ᴍᴏꜱᴛ ᴘᴏᴡᴇʀꜰᴜʟ ᴀᴜᴛᴏ ᴄᴀᴘᴛɪᴏɴ ʙᴏᴛ ᴡɪᴛʜ ᴘʀᴇᴍɪᴜᴍ ꜰᴇᴀᴛᴜʀᴇꜱ, ᴊᴜsᴛ ᴀᴅᴅ ᴍᴇ ᴛᴏ ʏᴏᴜʀ cʜᴀɴɴᴇʟ ᴀɴᴅ ᴇɴᴊᴏʏ

‣ ᴍᴀɪɴᴛᴀɪɴᴇᴅ ʙʏ : <a href='https://t.me/NOBODYBOTz'>𝙼𝚁. 𝙽𝚘𝚋𝚘𝚍𝚢🂱 𝙱𝚘𝚝𝚣</a></b>
"""

    HELP_TXT = """•••[( 𝘎𝘦𝘵 𝘏𝘦𝘭𝘱 )]•••

⚠️ ALTER ⚠️
• ᴀᴅᴅ ᴛʜɪs ʙᴏᴛ ɪɴ ʏᴏᴜʀ ᴄʜᴀɴɴᴇʟ ᴡɪᴛʜ
ᴀʟʟ ᴀᴅᴍɪɴ ᴘᴇʀᴍɪssɪᴏɴ
• ᴜsᴇ ᴛʜɪs ᴄᴏᴍᴍᴀɴᴅ ɪɴ ʏᴏᴜʀ ᴄʜᴀɴɴᴇʟ 
• ᴛʜɪs ᴄᴏᴍᴍᴀɴᴅ ᴡᴏʀᴋ ᴏɴʟʏ ᴄʜᴀɴɴᴇʟ
• ᴋᴇᴇᴘ ғɪʟᴇ ᴡɪᴛʜᴏᴜᴛ ғᴏʀᴡᴀʀᴅ ᴛᴀɢ

•>  /set_cap - sᴇᴛ ɴᴇᴡ ᴄᴀᴘᴛɪᴏɴ ɪɴ ʏᴏᴜʀ ᴄʜᴀɴɴᴇʟ
•> /del_cap - ᴅᴇʟᴇᴛᴇ ʏᴏᴜʀ ᴄᴀᴘᴛɪᴏɴ
•> /view - ᴠɪᴇᴡ ʏᴏᴜʀ ᴄᴀᴘᴛɪᴏɴ

Fᴏʀᴍᴀᴛ
{ғɪʟᴇ_ɴᴀᴍᴇ} = ᴏʀɪɢɪɴᴀʟ ғɪʟᴇ ɴᴀᴍᴇ
{ғɪʟᴇ_ᴄᴀᴘᴛɪᴏɴ} = ᴏʀɪɢɪɴᴀʟ ғɪʟᴇ ᴄᴀᴘᴛɪᴏɴ 
{ғɪʟᴇ_sɪᴢᴇ} = ғɪʟᴇ ᴏʀɪɢɪɴᴀʟ sɪᴢᴇ       

Eɢ:- /set
{file_name} or {file_caption}

⚙️ Size » {file_size}

╔═════ ᴊᴏɪɴ ᴡɪᴛʜ ᴜs ════╗
💥 𝙅𝙊𝙄𝙉 :- ᴄʜᴀɴɴᴇʟ ʟɪɴᴋ 
💥 𝙅𝙊𝙄𝙉 :- ᴄʜᴀɴɴᴇʟ ʟɪɴᴋ
╚═════ ᴊᴏɪɴ ᴡɪᴛʜ ᴜs ════╝
"""

    ABOUT_TXT = """<b>╔════❰ ᴀᴜᴛᴏ ᴄᴀᴘᴛɪᴏɴ ʙᴏᴛ ❱═❍⊱❁
║╭━━━━━━━━━━━━━━━➣
║┣⪼ᴍʏ ɴᴀᴍᴇ : <a href='https://t.me/AUTO_CAPTION_A1_BOT'>ᴀᴜᴛᴏ ᴄᴀᴘᴛɪᴏɴ</a>
║┣⪼ᴛʜɪs ʀᴇᴘᴏ ᴅᴇᴠ: <a href='https://t.me/NOBODY_BOTz'>ɴᴏʙᴏᴅʏ ʙᴏᴛᴢ™</a>
║┣⪼ʙᴀsᴇ ʀᴇᴘᴏ ᴅᴇᴠ:<a href='https://t.me/Pr0fess0r_99'>ᴍʀ ᴘʀᴏғᴇssᴏʀ</a>
║┣⪼ʙᴀꜱᴇ sᴏᴜʀᴄᴇ: <a href='https://github.com/PR0FESS0R-99/PrivateAutoCaption'>ᴘʀɪᴠᴀᴛᴇ ᴀᴜᴛᴏᴄᴀᴘᴛɪᴏɴ</a>
║┣⪼ᴜᴘᴅᴀᴛᴇ : <a href='https://t.me/NOBODY_BOTz'>ɴᴏʙᴏᴅʏ ʙᴏᴛᴢ™</a>
║┣━━━━━━━━➪ 
║┣⪼sᴇʀᴠᴇʀ: ᴘʀɪᴠᴀᴛᴇ 
║┣⪼ᴅᴀᴛᴀʙᴀsᴇ: ᴍᴏɴɢᴏ ᴅʙ
║┣⪼ʟᴀɴɢᴜᴀɢᴇ : ᴘʏᴛʜᴏɴ 3
║┣⪼ғʀᴀᴍᴇᴡᴏʀᴋ : ᴘʏʀᴏɢʀᴀᴍ
║┣⪼ᴍʏ ᴠᴇʀsɪᴏɴ : 1.6.0  [sᴛᴀʙʟᴇ]
║╰━━━━━━━━━━━━━━━➣
╚══════════════════❍⊱❁</b>"""
